import unittest

def key_sort (key):
    return key[1]
# courses = ["Python-разработчик с нуля", "Java-разработчик с нуля", "Fullstack-разработчик на Python", "Frontend-разработчик с нуля"]


def unique_mentor(mentors):

    all_list = []
    for m in mentors:
        all_list.extend(m)
    all_names_list = []
    all_names_list = [mentor.split()[0] for mentor in all_list]
    unique_names = list(set(all_names_list))
    popular = []
    for name in unique_names:
        popular.append([ all_names_list.count(name),name])# Добавьте подсчёт имён
    popular.sort(reverse=True)
    top_3 = popular[0:3]
    top_str = []
    for  count,name in top_3:
        top_str.append(name + ': ' + str(count))
    return top_str
# print(top_str)
# print(f'{" раз(а), ".join(top_str)} раз(а)')
class Test_mentors(unittest.TestCase):
    
    def test_mentor(self):
        result = ['Александр: 10', 'Евгений: 5', 'Максим: 4']
        mentors = [
	["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
	["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
	["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
	["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин", "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]
        self.assertEqual(unique_mentor(mentors),result)

if __name__ == '__main__':
    unittest.main()
    